{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "В некотором царстве, В некотором государстве, жил принц, счастливый и богатый. Но в какой-то момент его отец, Великий Велик Великович Величайший скончался, и пошел вопрос об разделении его богатсв по родственникам. Его украшения достались его 2 дочерям. Каждой дано по 3 украшения, но оказалось, что украшений было 5, и одни повторялись. Так что некоторые украшения были приписанны двум дочерям одновременно. Требуется найти повторения и их исправить(Если есть пара одинаковых, одно никому не давать), а затем распределить украшен\n",
        "равномерно.\n",
        "\n",
        "---\n",
        "\n",
        "Формат Ввода:\n",
        "Название каждого украшения через запятую и пробел(Гарантируется, что будут повторяющиеся)\n",
        "\n",
        "\n",
        "\n",
        "---\n",
        "\n",
        "Формат Вывода:\n",
        "\n",
        "Украшения, доставшися первой, а на новой строчке - второй\n",
        "\n",
        "\n",
        "\n",
        "---\n",
        "\n",
        "Пример:\n",
        "\n",
        "Ввод:\n",
        "\n",
        "Золотая цепь, Алмазная цепь, рубиновое кольцо, Золотая цепь, эмеральдные серги\n",
        "\n",
        "Вывод:\n",
        "\n",
        "1. Золотая цепь, эмеральдные серги\n",
        "2. Алмазная цепь, рубиновое кольцо"
      ],
      "metadata": {
        "id": "RLXUHOLfmBK5"
      }
    },
    {
      "cell_type": "code",
      "execution_count": 26,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "0gnb8SLJl4RZ",
        "outputId": "2283e8bd-0f12-4f8c-a623-fc03f8da6322"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "5 имещихся украшенияЗолотая цепь, Алмазная цепь, рубиновое кольцо, Золотая цепь, эмеральдные серги\n",
            "1. рубиновое кольцо , Золотая цепь\n",
            "2. Алмазная цепь , эмеральдные серги\n"
          ]
        }
      ],
      "source": [
        "jewer = set(input(\"5 имещихся украшения\" ).split(\", \"))\n",
        "\n",
        "print(\"1.\", list(jewer)[0],\",\",list(jewer)[1])\n",
        "print(\"2.\", list(jewer)[2],\",\",list(jewer)[3])\n"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Для сбора лицейского меню опросили N количество школьников, какие вторые блюда они хотели бы видеть в столовой. Опрошенным давали +5% к их баллу в поступление в лицей. Напишите программу, которая после ввода данных Выведет блюда, которые предложены в меню, а затем учеников, получивших бонус к поступлению.\n",
        "\n",
        "\n",
        "---\n",
        "\n",
        "Формат Ввода:\n",
        "\n",
        "N, затем N Количество строк, на каждой ученик и его предложение в меню.\n",
        "\n",
        "\n",
        "---\n",
        "\n",
        "Формат вывода:\n",
        "\n",
        "1.Cписок блюд\n",
        "2.Список учеников\n",
        "\n",
        "\n",
        "---\n",
        "\n",
        "Пример:\n",
        "\n",
        "Ввод:\n",
        "\n",
        "4\n",
        "\n",
        "Вася Пюре\n",
        "\n",
        "Петя Макароны\n",
        "\n",
        "Ваня Мясо\n",
        "\n",
        "Даша Рыба\n",
        "\n",
        "Вывод:\n",
        "\n",
        "Пюре Макароны Мясо Рыба\n",
        "\n",
        "Вася, Петя, Ваня, Даша"
      ],
      "metadata": {
        "id": "YvmAZP15KtaO"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "stud_food=dict()\n",
        "N = int(input())\n",
        "for i in range(N):\n",
        "   phrase =input().split()\n",
        "   student = phrase[0]\n",
        "   food = ' '.join(phrase[1:])\n",
        "   stud_food.setdefault(food, student)\n",
        "unique_dishes = list(stud_food.keys()) #Как дополнительный шаг убираю повторы, чтобы результат был чище\n",
        "name = list(stud_food.values())\n",
        "print(\"Список блюд: \",unique_dishes)\n",
        "print(\"Список учеников: \", name)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "L3QHA-WFpsCj",
        "outputId": "3154981e-b372-4c4c-8415-d05d7fa164e2"
      },
      "execution_count": 29,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "2\n",
            "Ваня Мясо\n",
            "Петя Рыба\n",
            "Список блюд:  ['Мясо', 'Рыба']\n",
            "Список учеников:  ['Ваня', 'Петя']\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [],
      "metadata": {
        "id": "Sq4FI251MwqJ"
      }
    }
  ]
}